
export const contentForModal = {
    rules: <ul>
                <li>
                    Сначала делает ход первый игрок. 
                    Фигуры нужно расположить на игровом поле таким образом, 
                    чтобы три одинаковых символа встали в ряд. 
                    Если вы делаете ход первым, самым выгодным будет поставить символ в центральный квадрат. 
                    Это увеличит ваши шансы на победу, давая возможность построить ряд «крестиков» или «ноликов»
                    в четырех направлениях (больше, чем дает любой другой ход).
                </li>
            <br />
                <li>
                    Затем делает ход второй игрок. После того, как сделан ход, 
                    второй игрок должен поставить свой символ, отличный от символа первого игрока. 
                    Второй игрок может либо попытаться помешать первому игроку поставить три символа в ряд, 
                    либо сфокусироваться на построении своего ряда из трех символов. 
                    В идеале игрок должен сделать и то, и другое.
                </li>
            <br />
                <li>
                    Продолжайте обмениваться ходами до тех пор, пока один из игроков не начертит три символа 
                    в один ряд или пока не наступит ничья. Первый, кто поставит три символа в ряд в любом 
                    из направлений, будь то вертикальный, горизонтальный или диагональный ряд, 
                    станет победителем. Тем не менее, если оба противника применяют оптимальную стратегию в игре, 
                    велика вероятность ничьи из-за того, что они успешно блокировали все возможности друг друга 
                    поставить три символа в ряд.
                </li>
        </ul>,
    aboutGame: <>
                <p>
                    Tic-tac-toe (американский английский), крестики-нолики (английский Содружества) 
                    или Xs и Os (канадский или ирландский английский) - это игра на бумаге и карандаше для двух игроков, 
                    которые по очереди отмечают пробелы в сетке три на три с помощью X или O. 
                    Игрок, которому удастся разместить три своих знака в горизонтальном, 
                    вертикальном или диагональном ряду, становится победителем. 
                    Это решаемая игра с принудительной ничьей, предполагающей лучшую игру обоих игроков.
                </p>

                <b>Имена</b>
                <p>На американском английском языке игра известна как "крестики-нолики".</p>

                <p>
                    На английском языке стран Содружества (в частности, на британском, 
                    южноафриканском, австралийском и новозеландском английском) 
                    игра известна как "крестики-нолики". 
                    Это название происходит от формы знаков в игре (то есть X и O); 
                    "ноль" - это более старое название числа ноль, 
                    в то время как "крест" относится к форме X. 
                    Хотя термин "ноль" в настоящее время используется реже, 
                    название "крестики-нолики" по-прежнему предпочтительнее американского 
                    "крестики-нолики" в этих странах.
                </p>
            </> 
}
